In [11]:
import pandas as pd
import numpy as np

In [12]:
df = {'id': [1, 2, 3, 4, 5],
      'created_at': ['2020-02-01', '2020-02-02', np.nan, '2020-02-02', np.nan],
      'type': ['red', np.nan, 'blue', np.nan, 'yellow']}

df = pd.DataFrame (df, columns = ['id', 'created_at','type'])

In [13]:
df

   id  created_at    type
0   1  2020-02-01     red
1   2  2020-02-02     NaN
2   3         NaN    blue
3   4  2020-02-02     NaN
4   5         NaN  yellow

In [15]:
df.dropna()

   id  created_at type
0   1  2020-02-01  red

In [16]:
df.dropna(axis=1)

   id
0   1
1   2
2   3
3   4
4   5

In [17]:
df.dropna(how="all")

   id  created_at    type
0   1  2020-02-01     red
1   2  2020-02-02     NaN
2   3         NaN    blue
3   4  2020-02-02     NaN
4   5         NaN  yellow